OpenFOAM-v2412/modules/OpenQBMM/tutorials/compressiblePbeTransportFoam/twentyThreeDegreeWedge/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication decomposePar 
runParallel compressiblePbeTransportFoam
runApplication reconstructPar
